DangDuc-SSS/Course_FastBit_EmbeddedSystems/03 Mastering Microcontroller and Embedded Driver Development  (MCU1)/codes written by me/00 stm32f407xx drivers/Src/017rtc_lcd.c
/*
 * 017rtc_lcd.c
 *
 *  Created on: 24 Jul 2022
 *      Author: abdo
 */

#include <stdio.h>
#include "stm32f407xx.h"
#include "ds1307.h"
#include "lcd.h"

char* get_day_of_week(uint8_t i);
char* time_to_string(RTC_time_t *rtc_time);
void number_to_string(uint8_t num, char *buff);
char* date_to_string(RTC_date_t *rtc_date);

#define SYSTICK_TIM_CLK		16000000UL



void init_systick_timer(uint32_t tick_hz)
{
	uint32_t *pSRVR = (uint32_t*)0xE000E014;
	uint32_t *pSCSR = (uint32_t*)0xE000E010;

    /* calculation of reload value */
    uint32_t count_value = (SYSTICK_TIM_CLK/tick_hz)-1;

    //Clear the value of SVR
    *pSRVR &= ~(0x00FFFFFFFF);

    //load the value in to SVR
    *pSRVR |= count_value;

    //do some settings
    *pSCSR |= ( 1 << 1); //Enables SysTick exception request:
    *pSCSR |= ( 1 << 2);  //Indicates the clock source, processor clock source

    //enable the systick
    *pSCSR |= ( 1 << 0); //enables the counter

}

RTC_time_t current_time;
RTC_date_t current_date;

int main(void)
{
	printf("RTC test\n");

	lcd_init();

	lcd_print_string("RTC Test...");

	mdelay(2000);

	lcd_display_clear();
	lcd_display_return_home();

	if(ds1307_init())
	{
		printf("RTC init has failed\n");
		while(1);
	}

	init_systick_timer(1);

	current_date.day = FRIDAY;
	current_date.date = 15;
	current_date.month = 1;
	current_date.year = 21;

	current_time.hours = 11;
	current_time.minutes = 59;
	current_time.seconds = 30;
	current_time.time_format = TIME_FORMAT_12HRS_PM;

	ds1307_set_current_date(&current_date);
	ds1307_set_current_time(&current_time);

	ds1307_get_current_time(&current_time);
	ds1307_get_current_date(&current_date);

	char *am_pm;
	if(current_time.time_format != TIME_FORMAT_24HRS)
	{
		am_pm = (current_time.time_format) ? "PM" : "AM";
		//printf("Current time = %s %s\n", time_to_string(&current_time), am_pm);	// 04:25:41 PM
		lcd_print_string(time_to_string(&current_time));
		lcd_print_string(am_pm);
	}
	else
	{
		//printf("Current time = %s\n", time_to_string(&current_time));	// 04:25:41
		lcd_print_string(time_to_string(&current_time));
	}

	// 15/01/21 <friday>
	//printf("Current date = %s <%s>\n", date_to_string(&current_date), get_day_of_week(current_date.day));
	lcd_set_cursor(2, 1);
	lcd_print_string(date_to_string(&current_date));
	lcd_print_string(get_day_of_week(current_date.day));

	while(1);
	return 0;
}

char* get_day_of_week(uint8_t i)
{
	char *days[] = {"Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday"};
	return days[i-1];
}


// hh:mm:ss
char* time_to_string(RTC_time_t *rtc_time)
{
	static char buff[9];
	buff[2] = ':';
	buff[5] = ':';
	number_to_string(rtc_time->hours, buff);
	number_to_string(rtc_time->minutes, &buff[3]);
	number_to_string(rtc_time->seconds, &buff[6]);
	buff[8] = '\0';
	return buff;
}

// dd/mm/yy
char* date_to_string(RTC_date_t *rtc_date)
{
	static char buff[9];
	buff[2] = '/';
	buff[5] = '/';
	number_to_string(rtc_date->date, buff);
	number_to_string(rtc_date->month, &buff[3]);
	number_to_string(rtc_date->year, &buff[6]);
	buff[8] = '\0';
	return buff;
}

void number_to_string(uint8_t num, char *buff)
{
	if(num < 10)
	{
		buff[0] = '0';
		buff[1] = num + 48;
	}
	else if(num >= 10 && num < 99)
	{
		buff[0] = (num / 10) + 48;
		buff[1] = (num % 10) + 48;
	}
}

void SysTick_Handler(void)
{
	ds1307_get_current_time(&current_time);


	lcd_set_cursor(1, 1);
	char *am_pm;
	if(current_time.time_format != TIME_FORMAT_24HRS)
	{
		am_pm = (current_time.time_format) ? "PM" : "AM";
		//printf("Current time = %s %s\n", time_to_string(&current_time), am_pm);	// 04:25:41 PM
		lcd_print_string(time_to_string(&current_time));
		lcd_print_string(am_pm);
	}
	else
	{
		//printf("Current time = %s\n", time_to_string(&current_time));	// 04:25:41
		lcd_print_string(time_to_string(&current_time));
	}

	ds1307_get_current_date(&current_date);
	//printf("Current date = %s <%s>\n", date_to_string(&current_date), get_day_of_week(current_date.day));
	lcd_set_cursor(2, 1);
	lcd_print_string(date_to_string(&current_date));
	lcd_print_char(' ');
	lcd_print_string(get_day_of_week(current_date.day));

}
